### Square the each elements in List.

In [1]:
lst=[1,2,3,4,5]

def square(n):
	return n*n

result=map(square,lst)
print(list(result))

[1, 4, 9, 16, 25]

### Add a square number in new list.

In [2]:
lst=[1,2,3,4,5]

lst2=[]

for i in lst:
    result=i*i
    lst2.append(result)
print(lst2)

[1, 4, 9, 16, 25]

### Finding the even number in list.

In [3]:
lst1=[10,15,20,25,30,35,40,45,50]


def even(num):
    if num%2==0:
        return True
    return False
    
result=filter(even,lst1)
print(list(result))

[10, 20, 30, 40, 50]

In [4]:
for i in lst1:
    if i%2==0:
        print("Even Number",i)
        print()
    else:
        print("Odd number",i)
        print()

Even Number 10

Odd number 15

Even Number 20

Odd number 25

Even Number 30

Odd number 35

Even Number 40

Odd number 45

Even Number 50

In [5]:
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# returns True if number is even
def check_even(number):
    if number % 2 == 0:
          return True  

    return False

# Extract elements from the numbers list for which check_even() returns True
even_numbers_iterator = filter(check_even, numbers)

# converting to list
even_numbers = list(even_numbers_iterator)

print(even_numbers)

[2, 4, 6, 8, 10]

### Finding the even number in list using Lambda function.

In [6]:
numbers = [1, 2, 3, 4, 5, 6, 7]

# the lambda function returns True for even numbers 
even_numbers_iterator = filter(lambda x: (x%2 == 0), numbers)

# converting to list
even_numbers = list(even_numbers_iterator)

print(even_numbers)

[2, 4, 6]

### Reversed the given string without using inbuild function.

In [7]:
### By using the REVERSED Fucntion.
name="Hitesh Yerekar Data Scientist"

result=reversed(name)
print(result)
print()
output=''.join(result)
print(output)

<reversed object at 0x000001CF93AC8948>

tsitneicS ataD rakereY hsetiH

In [8]:
### Without using inbuild function.
name[::-1]

'tsitneicS ataD rakereY hsetiH'

In [9]:
name="Hitesh Yerekar Data Scientist"

result=reversed(name)

for i in result:
    print(i)

t
s
i
t
n
e
i
c
S

a
t
a
D

r
a
k
e
r
e
Y

h
s
e
t
i
H

In [10]:
### Reversed the number Note: For that we need to convert that number into string.
a=12345

result=str(a)
final_result=result[::-1]

print(final_result)

54321

In [11]:
name =" Hitesh Yerekar is working as a Data Scientist"

### Reverse above string without using any inbuild function.
result=name[::-1]
print(result)

tsitneicS ataD a sa gnikrow si rakereY hsetiH

### Create the DataFrame by using the two list.

In [1]:
name=["Hitesh","Sonal","Sannidhya","Pranay","Pajju"]
Age=[30,33,5,16,17]

import pandas as pd
result=pd.DataFrame(list(zip(name,Age)),columns=["Name","Age"])
print(result)

        Name  Age
0     Hitesh   30
1      Sonal   33
2  Sannidhya    5
3     Pranay   16
4      Pajju   17

In [2]:
Name=['Virat','Sachin','Ganguly','Dravid','BretLee','Zaheer']
Skill=['Batsman','Batsman','Batsman','Batsman','Bowler','Bowler']
Age=[33,44,42,42,38,39]

import pandas as pd
Cricket_df=pd.DataFrame(list(zip(Name,Skill,Age)),columns=['Name','Skills','Age'])
Cricket_df

      Name   Skills  Age
0    Virat  Batsman   33
1   Sachin  Batsman   44
2  Ganguly  Batsman   42
3   Dravid  Batsman   42
4  BretLee   Bowler   38
5   Zaheer   Bowler   39

### Second method for creating dataframe using list.

In [3]:
data=pd.DataFrame()

data['Name']=name
data['Age']=Age

data

ValueError: Length of values (6) does not match length of index (5)

In [15]:
crick_info=pd.DataFrame()

crick_info['Player']=Name
crick_info['Skill']=Skill

crick_info

    Player    Skill
0    Virat  Batsman
1   Sachin  Batsman
2  Ganguly  Batsman
3   Dravid  Batsman
4  BretLee   Bowler
5   Zaheer   Bowler

### create the DataFrame using Dictionary.

In [16]:
dic={'name':name,'Age':Age}
dic_data=pd.DataFrame(dic)
dic_data

ValueError: arrays must all be same length

In [17]:
crick_dic={'Player_name':Name,'Skill_Type':Skill}

crick_data=pd.DataFrame(crick_dic)
crick_data

  Player_name Skill_Type
0       Virat    Batsman
1      Sachin    Batsman
2     Ganguly    Batsman
3      Dravid    Batsman
4     BretLee     Bowler
5      Zaheer     Bowler

### WAP to reversed the number.

In [18]:
num=12345
# First we need to convert number into string datatype.
s=str(num)
print(s)
print()
# Now we convert string reveresed.
result=int(s[::-1])
print(int(result))
print(type(result))

12345

54321
<class 'int'>

### Creating the new column in DataFrame by using exting column values.

In [19]:
import pandas as pd

num1=[10,20,30,40,50]
num2=[2,4,6,8,10]

## Creating the dictionary by using two lists.
d={'Number1':num1,'Number2':num2}
print(d)

print()
## Converting dictionary into DataFramne
data=pd.DataFrame(d)
print(data)

## Creating new column in DataFrame.

data['Sum']=data['Number1']+data['Number2']
data['Difference']=data['Number1']-data['Number2']

data

{'Number1': [10, 20, 30, 40, 50], 'Number2': [2, 4, 6, 8, 10]}

   Number1  Number2
0       10        2
1       20        4
2       30        6
3       40        8
4       50       10

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

### How to delete Column or Group of columns in DataFrame.

In [20]:
print("Before deleting the column in DataFrame")
print(data)
print()
print("After deleting column in DataFrame")
final_data=data.drop(['Difference'],axis=1)
final_data

Before deleting the column in DataFrame
   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

After deleting column in DataFrame

   Number1  Number2  Sum
0       10        2   12
1       20        4   24
2       30        6   36
3       40        8   48
4       50       10   60

In [21]:
## delete the two columns in DataFrame.
data

final_result=data.drop(['Sum','Difference'],axis=1)
final_result

   Number1  Number2
0       10        2
1       20        4
2       30        6
3       40        8
4       50       10

### Sorting the columns in dataframe.

In [22]:
data

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

In [23]:
sort_data=data.sort_values(by='Sum', ascending=False)
sort_data

   Number1  Number2  Sum  Difference
4       50       10   60          40
3       40        8   48          32
2       30        6   36          24
1       20        4   24          16
0       10        2   12           8

In [24]:
### sorting the two columns in DataFrame.

data_sort=data.sort_values(by=['Sum','Number1'],ascending=['F','T'])
data_sort

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

### How to deleet perticular rows from DataFrame based on value.

In [25]:
data

## we need to delete data from sum columns whose values is sum is 11.
print()
print("After deleting values")
print()
data.dropna(inplace=True)
result=data[data.Sum!=11]
result

After deleting values

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

In [26]:
data

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

In [27]:
### Using second method.Using Drop() method.

result=data.drop(data.index[data['Difference']==40],inplace=True)
data

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32

In [28]:
### deleting the multiple rwos from dataframe.using isin() method
data_sort

   Number1  Number2  Sum  Difference
0       10        2   12           8
1       20        4   24          16
2       30        6   36          24
3       40        8   48          32
4       50       10   60          40

In [29]:
result=data_sort.drop(data_sort.index[data_sort['Number2'].isin([2,4,6])])
result

   Number1  Number2  Sum  Difference
3       40        8   48          32
4       50       10   60          40

In [30]:
import pandas as pd
# create dataframe
df = pd.DataFrame({
    'Name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie', 'Ekans'],
    'Type': ['Grass', 'Fire', 'Water', 'Bug', 'Poison']
})
# display the dataframe
print(df)

         Name    Type
0   Bulbasaur   Grass
1  Charmander    Fire
2    Squirtle   Water
3    Caterpie     Bug
4       Ekans  Poison

### 1. Remove first n rows with .iloc

In [31]:
result=df.iloc[2:]
print(df)
print()
print(result)

         Name    Type
0   Bulbasaur   Grass
1  Charmander    Fire
2    Squirtle   Water
3    Caterpie     Bug
4       Ekans  Poison

       Name    Type
2  Squirtle   Water
3  Caterpie     Bug
4     Ekans  Poison

### 2. Remove first n rows with drop().

In [32]:
result=df.drop(df.index[:2])
print(df)
print()
print(result)

         Name    Type
0   Bulbasaur   Grass
1  Charmander    Fire
2    Squirtle   Water
3    Caterpie     Bug
4       Ekans  Poison

       Name    Type
2  Squirtle   Water
3  Caterpie     Bug
4     Ekans  Poison

### 3. Remove first n rows with tail().

In [33]:
result=df.tail(-2)
print(df)
print()
print(result)

         Name    Type
0   Bulbasaur   Grass
1  Charmander    Fire
2    Squirtle   Water
3    Caterpie     Bug
4       Ekans  Poison

       Name    Type
2  Squirtle   Water
3  Caterpie     Bug
4     Ekans  Poison

### 1. Remove the last n rows with .iloc

In [34]:
result=df.iloc[:-2]
print(df)
print()
print(result)

         Name    Type
0   Bulbasaur   Grass
1  Charmander    Fire
2    Squirtle   Water
3    Caterpie     Bug
4       Ekans  Poison

         Name   Type
0   Bulbasaur  Grass
1  Charmander   Fire
2    Squirtle  Water

### 2. Remove the last n rows with drop().

In [35]:
result=df.drop(df.index[-2:])
print(df)
print()
print(result)

         Name    Type
0   Bulbasaur   Grass
1  Charmander    Fire
2    Squirtle   Water
3    Caterpie     Bug
4       Ekans  Poison

         Name   Type
0   Bulbasaur  Grass
1  Charmander   Fire
2    Squirtle  Water

### 3. Remove last n rows with head().

In [36]:
result=df.head(-2)
result

         Name   Type
0   Bulbasaur  Grass
1  Charmander   Fire
2    Squirtle  Water

### How to remove empty string in List.

In [37]:
lst=['Hitesh',22,55,"","Data Scientist"]

result=list(filter(None,lst))
print(result)

['Hitesh', 22, 55, 'Data Scientist']

### Ways to remove multiple empty spaces from string List.

In [38]:
test_list = ['gfg', '   ', ' ', 'is', '            ', 'best']

print(test_list)

## Using strip fuction we can remove multiple empty string from a list of string.
result=[]
for i in test_list:
    if i.strip():
        result.append(i)
print(result)

['gfg', '   ', ' ', 'is', '            ', 'best']
['gfg', 'is', 'best']

In [39]:
### Second Method.
res = [ele for ele in test_list if ele.strip()]
print(res)

['gfg', 'is', 'best']

### How to concat two list of string.

In [40]:
l1=['Hitesh','is','Data']
l2=['Yerekar','Good','Scientist']

concat_result=[i + j for i,j in zip(l1,l2)]
print(concat_result)

['HiteshYerekar', 'isGood', 'DataScientist']

### Remove unwanted spaces from string.

In [41]:
import re
test_str = "GfG  is   good           website"
print("original String =",str(test_str))
print()
print("After removing unwanted spaces from string")
result=re.sub(' +',' ',test_str)
print(result)

original String = GfG  is   good           website

After removing unwanted spaces from string
GfG is good website

In [42]:
### Method-2
### with the help of string_join.

result=' '.join(test_str.split())
print(result)

GfG is good website

### Remove empty tuples from a list.

In [43]:
tuples = [(), ('ram','15','8'), (), ('laxman', 'sita'),
          ('krishna', 'akbar', '45'), ('',''),()]
print(tuples)
print()
print("Removing empty tuples from list of tuples")
print("using Filter method")
result=list(filter(None,tuples))
print()
print(result)

[(), ('ram', '15', '8'), (), ('laxman', 'sita'), ('krishna', 'akbar', '45'), ('', ''), ()]

Removing empty tuples from list of tuples
using Filter method

[('ram', '15', '8'), ('laxman', 'sita'), ('krishna', 'akbar', '45'), ('', '')]

In [44]:
string_test=["Hietsh","Ramrao","Yerekar"]
output=''.join(string_test)
print(output)
print()
rev_str=output[::-1]
print(rev_str)
print()
result=string_test[::-1]
print(result)

HietshRamraoYerekar

rakereYoarmaRhsteiH

['Yerekar', 'Ramrao', 'Hietsh']

In [45]:
str_lst="Hitesh Ramrao Yerekar"
result=str_lst[::-1]
print(result)

rakereY oarmaR hsetiH

### Concatenate two tuples.

In [46]:
tup1=(1,2,3)
tup2=(4,5,6)

result=tup1+tup2
print(result)

(1, 2, 3, 4, 5, 6)

### WAP to find the least positive integer missing from a list of input integer.(Tiger Analytics).

In [47]:
### Method 1
def min_pos(list_1):
     for i in range(1,max(list_1)+1):
        if (i not in list_1):
            return(i)

In [48]:
min_pos( [3,7,-1,8,9,10])

1

In [49]:
min_pos(num)

TypeError: 'int' object is not iterable

In [50]:
### Method -2.

for i in range(1,max(nums)):
    if i in nums:
        continue
    else:
        print(i)
        break

NameError: name 'nums' is not defined

In [51]:
nums= [3,7,-1,8,9,10]

In [52]:
num=[2, 3, 7,1, 6, 8, -1, -10, 15]

### WAP to add two numbers without using '+' operator.

In [53]:
def sum(a, b):
    return - (-a - b)

In [54]:
sum(5,4)

9

In [55]:
def add_num(x,y):
     return x-(y*(-1))

In [56]:
add_num(5,5)

10

In [57]:
name="Hitesh"
result=name[:4]
print(result)

Hite

In [58]:
result=name[1:4]
print(result)

ite

In [59]:
result=name[4:]
print(result)

sh

In [60]:
result=name[-4:]
print(result)

tesh

In [61]:
result=name[:-4]
print(result)

Hi

### Convert list of string into string.

In [62]:
name=['Hitesh','Yerekar','is','Data','Scientist']
print()
result=' '.join(name)
print(result)

Hitesh Yerekar is Data Scientist

### Converting string into list of string.

In [63]:
data="Pune is a beautiful city"
print()
result=data.split()
print(result)

['Pune', 'is', 'a', 'beautiful', 'city']

In [64]:
data="Pune is a beautiful city"
print()
result=list(data.split())
print(result)

['Pune', 'is', 'a', 'beautiful', 'city']

In [65]:
### Reversed the each element in string.

data="Pune is a beautiful city"
print()
result=data.split()
print(result)
print()
data1=data[::-1]
print(data1)

['Pune', 'is', 'a', 'beautiful', 'city']

ytic lufituaeb a si enuP

### *** Write a programm to find the missing number from a list.(Tiger Analytics)

Example:-

input= [1,2,3,4,6,7,10]

output=[ [5,8,9]

In [66]:
input= [1,2,3,4,6,7,10]
print("Original List")
print(input)
print()
missing_val=[]

for i in range(1,max(input)):
     if i not in input:
            missing_val.append(i)
            
print("Missing value in list")
print(missing_val)

Original List
[1, 2, 3, 4, 6, 7, 10]

Missing value in list
[5, 8, 9]

In [67]:
### Second Method:-
import numpy as np
#y = [6,7,8,9,10,11,12,15]
def missing_numbers(lst):
    h = set(range(np.min(input),np.max(input)+1))
    return list(set(h)-set(lst))
missing_numbers(input)

[8, 9, 5]

In [68]:
### Third Method:-

def missing_val(lst):
    result=[i for i in range(0,lst[-1]+1) if i not in lst]
    print(result)
    
missing_numbers(input)

[8, 9, 5]

In [69]:
lst = [10, 11, 12, 13, 14, 15]
lst.reverse()
print("Using Reverse Method",lst)
print()
new_list=reversed(lst)
print("Using Reversed Method",list(new_list))

Using Reverse Method [15, 14, 13, 12, 11, 10]

Using Reversed Method [10, 11, 12, 13, 14, 15]

In [70]:
### Finding the minimum and maximum number from list.

print("Minimum number from list =",min(lst))
print()
print("Maximum number from list =",max(lst))

Minimum number from list = 10

Maximum number from list = 15

### Python program to find the sum of all items in a dictionary.

In [71]:
def dict_sum(dict):
    sum=0
    for i in dict:
        sum=sum+dict[i]
    
    return sum
    
dic={'a': 100, 'b': 200, 'c': 300,'d':400,'e':50,'f':250,'g':550}
print(dict_sum(dic))

1850

In [72]:
### Second method.

def dict_addition(dict):
    return sum(dict.values())

dict_addition(dic)

TypeError: sum() missing 1 required positional argument: 'b'

### How to sort the dictionary values.

In [73]:
### Sorting dictionary in ascending order.

data={'a': 100, 'b': 200, 'c': 300,'d':400,'e':50,'f':250,'g':550}
print("before Sorting a dictionary")
print()
print("After sorting the dictionary")
result=sorted(data.values())
result

before Sorting a dictionary

After sorting the dictionary

[50, 100, 200, 250, 300, 400, 550]

In [74]:
# Sorting dictionary in descending ordered.

print("after sorting the dictionary in descedning ordered")
print()
desceding_dic=sorted(data.values(),reverse=True)
print(desceding_dic)

after sorting the dictionary in descedning ordered

[550, 400, 300, 250, 200, 100, 50]

In [75]:
name=['Hitesh','Sonal','Krunal','Sonal','Sannu','Chintan','Sannu','Pratik','Chintan']

result=list(set(name))
print(result)

['Chintan', 'Pratik', 'Hitesh', 'Sonal', 'Sannu', 'Krunal']

### How to find the len of rows and columns in DataFrame.

In [76]:
len_col=len(df.axes[1])
len_row=len(df.axes[0])

In [77]:
print(len_col)
print(len_row)

2
5